---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BlendStartParam
source: html/8d158924-00f9-3255-10b0-8764a63ac9f6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BlendStartParam Property

"First End"

## Syntax (C#)
```csharp
public static ForgeTypeId BlendStartParam { get; }
```